Revit.GeometryConversion.NurbsUtils.ElevateBezierDegree(Autodesk.DesignScript.Geometry.NurbsCurve,System.Int32)
Elevate the degree of a Bezier curve (represented in NURBS form) to a given degree
without changing the shape
crv: The curve
finalDegree: The requested degree
Returns: